app/controllers/exercices_controller.rb

SELECT  "exercices".* FROM "exercices"  WHERE "exercices"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_exercice
      @exercice = Exercice.find(params[:id])